Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Distributed key-value store for service discovery
fr: Stockage distribué clé-valeur pour la découverte de services
ko: 서비스 검색용 분산 키-값 저장소
tr: Servis keşfi için dağıtık anahtar-değer deposu
vi: Kho key-value phân tán cho service discovery
zh_hans: 用于服务发现的分布式键值存储
zh_hant: 用於服務探索的分散式鍵值儲存

source: Add Label After…
fr: Ajouter l'étiquette après...

source: Deny
fr: Nier
ko: 거부
tr: Reddet
vi: Từ chối
zh_hans: 拒绝
zh_hant: 拒絕

source: No RDS instances or Aurora clusters in %@.
fr: Aucune instance RDS ou aucun cluster Aurora dans %@.

source: Limit
fr: Limite
ko: 제한
vi: Giới hạn
zh_hans: 限制
zh_hant: 限制

source: Select an activity entry to see its details.
fr: Sélectionnez une entrée d'activité pour voir ses détails.
ko: 세부사항을 볼 활동 항목을 선택하십시오.
tr: Ayrıntılarını görmek için bir etkinlik kaydı seçin.
vi: Chọn một mục hoạt động để xem chi tiết.
zh_hans: 选择一个活动条目以查看详细信息。
zh_hant: 選擇一個活動項目以查看詳細資訊。

source: Reset All Customizations
fr: Réinitialiser toutes les personnalisations
ko: 모든 사용자화 재설정
tr: Tüm Özelleştirmeleri Sıfırla
vi: Đặt lại tất cả tùy chỉnh
zh_hans: 重置所有自定义
zh_hant: 重設所有自訂設定

source: Edit: read-only tools plus running queries. Destructive DDL stays blocked.
fr: Modification : outils en lecture seule plus exécution de requêtes. La DDL destructrice reste bloquée.
ko: 편집: 읽기 전용 도구와 쿼리 실행. 파괴적 DDL은 계속 차단됩니다.
tr: Düzenle: salt okunur araçlar ve sorgu çalıştırma. Yıkıcı DDL engellenmeye devam eder.
vi: Sửa: các công cụ chỉ đọc cùng với chạy truy vấn. DDL phá hủy vẫn bị chặn.
zh_hans: 编辑：只读工具加运行查询。破坏性 DDL 仍被阻止。
zh_hant: 編輯：唯讀工具加上執行查詢。破壞性 DDL 仍會被封鎖。

source: This permanently deletes the selected rows from the database and can't be undone.
fr: Cela supprime définitivement les lignes sélectionnées de la base de données et ne peut pas être annulé.
ko: 선택한 행을 데이터베이스에서 영구적으로 삭제하며 실행 취소할 수 없습니다.
tr: Bu, seçili satırları veritabanından kalıcı olarak siler ve geri alınamaz.
vi: Thao tác này xóa vĩnh viễn các dòng đã chọn khỏi cơ sở dữ liệu và không thể hoàn tác.
zh_hans: 此操作会从数据库中永久删除所选行，且无法撤销。
zh_hant: 此操作會從資料庫中永久刪除所選的列，且無法復原。

source: The form produced no statements to run.
fr: Le formulaire n'a produit aucune déclaration à exécuter.

source: Nothing got at least %1$lld%% slower than the period before. A query needs %2$lld runs in both periods, and has to have grown by at least %3$@.
fr: Rien n'a été au moins %1$lld%% plus lent que la période précédente. Une requête doit avoir %2$lld exécutions dans les deux périodes et avoir augmenté d'au moins %3$@.
ko: 이전 기간보다 %1$lld%% 이상 느려진 항목이 없습니다. 쿼리는 두 기간 모두에서 %2$lld회 실행되어야 하며, 최소 %3$@만큼 증가해야 합니다.
tr: Hiçbir şey önceki döneme göre en az %1$lld%% yavaşlamadı. Bir sorgunun her iki dönemde de %2$lld çalışması ve en az %3$@ artmış olması gerekir.
vi: Không có gì chậm đi ít nhất %1$lld%% so với kỳ trước. Một truy vấn cần %2$lld lần chạy ở cả hai kỳ và phải tăng thêm ít nhất %3$@.
zh_hans: 没有任何查询比上一时段慢了至少 %1$lld%%。一个查询需要在两个时段各运行 %2$lld 次，并且至少增加了 %3$@。
zh_hant: 沒有任何查詢比上一時段慢了至少 %1$lld%%。一個查詢需要在兩個時段各執行 %2$lld 次，並且至少增加了 %3$@。

source: Window that came forward
fr: La fenêtre qui est venue en avant
ko: 앞으로 나온 창
tr: Öne gelen pencere
vi: Cửa sổ đã được đưa lên trước
zh_hans: 被带到最前的窗口
zh_hant: 被帶到最前的視窗

source: killing a server session
fr: Tuer une session de serveur
ko: 서버 세션 종료
tr: bir sunucu oturumunu sonlandırma
vi: kết thúc một phiên máy chủ
zh_hans: 终止一个服务器会话
zh_hant: 終止一個伺服器工作階段

source: Could not create %@.
fr: Impossible de créer %@.

source: %1$@ returned %2$lld values for %3$lld columns.
fr: %1$@ a renvoyé des valeurs %2$lld pour les colonnes %3$lld.

source: Descending
fr: Descendant
ko: 내림차순
tr: Azalan
vi: Giảm dần
zh_hans: 降序
zh_hant: 降序

source: Prompt for API token
fr: Demander le jeton API
ko: API 토큰 입력 요청
tr: API belirtecini sor
vi: Hỏi token API
zh_hans: 提示输入 API 令牌
zh_hant: 提示輸入 API 權杖

source: at sign
fr: arobase
ko: 골뱅이표
tr: et işareti
vi: ký hiệu a còng
zh_hans: at 符号
zh_hant: at 符號

source: Variant id
fr: Identifiant de la variante
ko: 변형 id
tr: Varyant kimliği
vi: Id biến thể
zh_hans: 变体 id
zh_hant: 變體 id

source: Columns in declaration order
fr: Colonnes dans l'ordre de déclaration
ko: 선언 순서대로 나열한 열
tr: Bildirim sırasına göre sütunlar
vi: Cột theo thứ tự khai báo
zh_hans: 按声明顺序排列的列
zh_hant: 按宣告順序排列的欄位

# Connection: %@, %@
source: Connection: %1$@, %2$@
fr: Connexion : %1$@, %2$@
ko: 연결: %1$@, %2$@
tr: Bağlantı: %1$@, %2$@
vi: Kết nối: %1$@, %2$@
zh_hans: 连接：%1$@，%2$@
zh_hant: 連線：%1$@, %2$@

source: Keeps the first row of each group of matching rows. Rows hidden by a filter or search are not compared.
fr: Conserve la première rangée de chaque groupe de rangées correspondantes. Les rangées cachées par un filtre ou une recherche ne sont pas comparées.

source: Columns, indexes, foreign keys and an approximate row count for one table.
fr: Colonnes, index, clés étrangères et un nombre approximatif de lignes pour une table.
ko: 한 테이블의 열, 인덱스, 외래 키 및 대략적인 행 수입니다.
tr: Bir tablonun sütunları, indeksleri, yabancı anahtarları ve yaklaşık satır sayısı.
vi: Cột, chỉ mục, khoá ngoại và số dòng ước tính của một bảng.
zh_hans: 一张表的列、索引、外键和大致行数。
zh_hant: 一張資料表的欄位、索引、外鍵和大致列數。

source: 1 statement
fr: 1 déclaration

source: Schema "%@" no longer exists.
fr: Le schéma "%@" n'existe plus.

source: Actual Rows
fr: Rangs réels
ko: 실제 행
tr: Gerçek Satır
vi: Số hàng thực tế
zh_hans: 实际行数
zh_hant: 實際列數

source: Counting values…
fr: Compter les valeurs...

source: Refreshing will discard all unsaved changes.
fr: La mise à jour supprimera toutes les modifications non enregistrées.
ko: 새로 고치면 저장하지 않은 모든 변경 사항이 삭제됩니다.
tr: Yenileme, kaydedilmemiş tüm değişiklikleri siler.
vi: Làm mới sẽ hủy tất cả thay đổi chưa lưu.
zh_hans: 刷新将丢弃所有未保存的更改。
zh_hant: 重新整理將捨棄所有未儲存的變更。

source: Use the instance's private IP address instead of its public IP.
fr: Utilisez l'adresse IP privée de l'instance au lieu de son adresse IP publique.
ko: 인스턴스의 공용 IP 대신 비공개 IP 주소를 사용합니다.
tr: Örneğin genel IP'si yerine özel IP adresini kullanır.
vi: Dùng địa chỉ IP riêng của instance thay cho IP công khai.
zh_hans: 使用该实例的专用 IP 地址，而不是公共 IP。
zh_hant: 使用該執行個體的專用 IP 位址，而不是公用 IP。

source: Actual Startup Time
fr: Temps de démarrage réel
ko: 실제 시작 시간
tr: Gerçek Başlangıç Süresi
vi: Thời gian bắt đầu thực tế
zh_hans: 实际启动时间
zh_hant: 實際啟動時間

source: Jump to column…
fr: Sautez à la colonne...

source: Count every row rather than estimating
fr: Comptez chaque rangée plutôt que d'estimer.
ko: 추정하지 않고 모든 행을 셉니다
tr: Tahmin etmek yerine her satırı sayar
vi: Đếm từng dòng thay vì ước lượng
zh_hans: 逐行统计而不是估算
zh_hant: 逐列統計而不是估算

source: Separator or pattern
fr: Séparateur ou motif
ko: 구분 기호 또는 패턴
tr: Ayırıcı veya desen
vi: Dấu phân cách hoặc mẫu
zh_hans: 分隔符或模式
zh_hant: 分隔符號或模式

source: You will be prompted for a verification code each time you connect.
fr: Vous serez invité à saisir un code de vérification à chaque fois que vous vous connectez.
ko: 연결할 때마다 인증 코드를 입력해야 합니다.
tr: Her bağlandığınızda doğrulama kodu istenecektir.
vi: Bạn sẽ được yêu cầu nhập mã xác minh mỗi lần kết nối.
zh_hans: 每次连接时都会要求您输入验证码。
zh_hant: 每次連線時都會要求你輸入驗證碼。

source: Chart Type
fr: Type de graphique
ko: 차트 종류
tr: Grafik Türü
vi: Loại biểu đồ
zh_hans: 图表类型
zh_hant: 圖表類型

source: External integrations and MCP client requests will appear here.
fr: Les intégrations externes et les demandes de clients MCP apparaîtront ici.
ko: 외부 통합 및 MCP 클라이언트 요청이 여기에 표시됩니다.
tr: Harici entegrasyonlar ve MCP istemci istekleri burada görünür.
vi: Các tích hợp bên ngoài và yêu cầu từ MCP client sẽ xuất hiện ở đây.
zh_hans: 外部集成和 MCP 客户端请求将显示在此处。
zh_hant: 外部整合與 MCP 用戶端要求將顯示於此處。

source: Disconnect client?
fr: Déconnecter le client ?
ko: 클라이언트 연결을 해제하시겠습니까?
tr: İstemcinin bağlantısı kesilsin mi?
vi: Ngắt kết nối client?
zh_hans: 断开客户端连接？
zh_hant: 要中斷用戶端連線嗎？

source: Changing the collation of %@ can change sort order and uniqueness.
fr: Le changement de la classification de %@ peut modifier l'ordre de tri et l'unicité.
ko: %@의 콜레이션을 변경하면 정렬 순서와 고유성이 달라질 수 있습니다.
tr: %@ karşılaştırmasını değiştirmek sıralama düzenini ve benzersizliği değiştirebilir.
vi: Đổi đối chiếu của %@ có thể thay đổi thứ tự sắp xếp và tính duy nhất.
zh_hans: 更改 %@ 的排序规则可能会改变排序顺序和唯一性。
zh_hant: 變更 %@ 的定序可能會改變排序順序和唯一性。

source: Columns (comma-separated)
fr: Colonnes (separées par des virgules)
ko: 열(쉼표로 구분)
tr: Sütunlar (virgülle ayrılmış)
vi: Các cột (phân tách bằng dấu phẩy)
zh_hans: 列（逗号分隔）
zh_hant: 欄位（以逗號分隔）

source: Users and roles, sorted by name
fr: Utilisateurs et rôles, triés par nom
ko: 이름순으로 정렬된 사용자 및 역할
tr: Ada göre sıralanmış kullanıcılar ve roller
vi: Người dùng và vai trò, sắp xếp theo tên
zh_hans: 按名称排序的用户和角色
zh_hant: 按名稱排序的使用者和角色

source: Attribute key
fr: Clé d'attribut
ko: 속성 키
tr: Öznitelik anahtarı
vi: Khoá thuộc tính
zh_hans: 属性键
zh_hant: 屬性鍵

source: Database the session is on
fr: Base de données sur laquelle la session est en cours
ko: 세션이 사용 중인 데이터베이스
tr: Oturumun bulunduğu veritabanı
vi: Cơ sở dữ liệu mà phiên đang dùng
zh_hans: 该会话所在的数据库
zh_hant: 該工作階段所在的資料庫

source: Hide Inspector
fr: Cacher l'inspecteur
ko: 인스펙터 가리기
tr: Denetçiyi Gizle
vi: Ẩn thanh kiểm tra
zh_hans: 隐藏检查器
zh_hant: 隱藏檢閱器

source: This item no longer exists.
fr: Cet article n'existe plus.

source: Data Grid Font
fr: Police de grille de données
ko: 데이터 그리드 글꼴
tr: Veri Tablosu Yazı Tipi
vi: Phông chữ bảng dữ liệu
zh_hans: 数据表格字体
zh_hant: 資料格字型

source: SOCKS proxy host is required
fr: Un hôte proxy SOCKS est requis.
ko: SOCKS 프록시 호스트가 필요합니다
tr: SOCKS proxy sunucusu gerekli
vi: Cần nhập máy chủ SOCKS proxy
zh_hans: 需要填写 SOCKS 代理主机
zh_hant: 需要填寫 SOCKS 代理主機

source: Quit Anyway
fr: Arrêtez de toute façon
ko: 그래도 종료
tr: Yine de Çık
vi: Vẫn thoát
zh_hans: 仍然退出
zh_hant: 仍要結束

source: Add Connection
fr: Ajouter une connexion
ko: 연결 추가
tr: Bağlantı Ekle
vi: Thêm kết nối
zh_hans: 添加连接
zh_hant: 新增連線

source: Clear the queries shown here
fr: Effacer les requêtes affichées ici
ko: 여기에 표시된 쿼리 지우기
tr: Burada gösterilen sorguları temizle
vi: Xoá các truy vấn đang hiển thị ở đây
zh_hans: 清除此处显示的查询
zh_hant: 清除此處顯示的查詢

source: Transfer failed: %@
fr: Transfert échoué : %@

source: Nothing is written until Apply.
fr: Rien n'est écrit avant de postuler.
ko: 적용하기 전에는 아무것도 기록되지 않습니다.
tr: Uygula'ya kadar hiçbir şey yazılmaz.
vi: Không có gì được ghi cho đến khi Áp dụng.
zh_hans: 在点按“应用”之前不会写入任何内容。
zh_hant: 在按下「套用」之前不會寫入任何內容。

source: Git exited with status %d.
fr: Git s'est terminé avec le statut %d.

source: %1$@ and %2$@ do not share a type system, so the structure below was rewritten. Check it before copying.
fr: %1$@ et %2$@ ne partagent pas un système de types, donc la structure ci-dessous a été réécrite. Vérifiez-la avant de la copier.

source: Copy Output
fr: Copie de sortie

source: Get the DDL (CREATE statement) for a table.
fr: Obtenez la DDL (instruction CREATE) pour une table.
ko: 테이블의 DDL(CREATE 문)을 가져옵니다.
tr: Bir tablonun DDL'sini (CREATE deyimi) alır.
vi: Lấy DDL (câu lệnh CREATE) của một bảng.
zh_hans: 获取表的 DDL（CREATE 语句）。
zh_hant: 取得資料表的 DDL（CREATE 陳述式）。

source: Include NULL values
fr: Inclure des valeurs NULL
ko: NULL 값 포함
tr: NULL değerleri dahil et
vi: Bao gồm giá trị NULL
zh_hans: 包含 NULL 值
zh_hant: 包含 NULL 值

source: List Users and Roles
fr: Liste des utilisateurs et des rôles
ko: 사용자 및 역할 목록
tr: Kullanıcıları ve Rolleri Listele
vi: Liệt kê người dùng và vai trò
zh_hans: 列出用户和角色
zh_hant: 列出使用者和角色

source: Change this in Settings > Integrations.
fr: Modifiez cela dans Paramètres > Intégrations.

source: What ran against %@
fr: Ce qui s'est opposé à %@
ko: %@에 대해 실행된 내용
tr: %@ üzerinde ne çalıştı
vi: Những gì đã chạy trên %@
zh_hans: 在 %@ 上运行了什么
zh_hant: 在 %@ 上執行了什麼

source: Reconnecting failed after %d attempts.
fr: La réconnection a échoué après %d tentatives.
ko: %d번 시도한 후에도 다시 연결하지 못했습니다.
tr: %d denemeden sonra yeniden bağlanılamadı.
vi: Kết nối lại thất bại sau %d lần thử.
zh_hans: 重连在 %d 次尝试后失败。
zh_hant: 重新連線在 %d 次嘗試後失敗。

# Version %@ (Build %@)
source: Version %1$@ (Build %2$@)
fr: Version %1$@ (Construction %2$@)
ko: 버전 %1$@ (빌드 %2$@)
tr: Version %@ (Build %@)
vi: Phiên bản %1$@ (Bản dựng %2$@)
zh_hans: 版本 %@（构建 %@）
zh_hant: 版本 %1$@（組建 %2$@）

source: TablePro could not tell whether %@ is MySQL's client or MariaDB's. They take different SSL options, and it will not guess for a connection that asks for an encrypted one. Reinstall the client tools and try again.
fr: TablePro n'a pas pu déterminer si %@ est le client de MySQL ou celui de MariaDB. Ils prennent différentes options SSL, et il ne pourra pas deviner pour une connexion qui demande une connexion cryptée. Réinstallez les outils clients et réessayez.

source: Bool False
fr: Vrai Faux
ko: 불리언 False
tr: Bool Yanlış
zh_hans: 布尔值 False
zh_hant: 布林值 False

source: collapse
fr: s'effondrer
ko: 접기
tr: daralt
vi: thu gọn
zh_hans: 收起
zh_hant: 收合

source: The user did not approve this operation.
fr: L'utilisateur n'a pas approuvé cette opération.
ko: 사용자가 이 작업을 승인하지 않았습니다.
tr: Kullanıcı bu işlemi onaylamadı.
vi: Người dùng đã không phê duyệt thao tác này.
zh_hans: 用户未批准此操作。
zh_hant: 使用者未核准此操作。

source: Show Connections
fr: Afficher les connexions
ko: 연결 보기
tr: Bağlantıları Göster
vi: Hiện kết nối
zh_hans: 显示连接
zh_hant: 顯示連線

source: The table has no primary key, so this row cannot be identified.
fr: La table n'a pas de clé primaire, donc cette ligne ne peut pas être identifiée.
ko: 테이블에 기본 키가 없어 이 행을 식별할 수 없습니다.
tr: Tablonun birincil anahtarı yok, bu yüzden bu satır tanımlanamıyor.
vi: Bảng không có khoá chính nên không xác định được dòng này.
zh_hans: 该表没有主键，因此无法识别这一行。
zh_hant: 該資料表沒有主鍵，因此無法識別這一列。

source: Pre-connect script was cancelled
fr: Le script de pré-connexion a été annulé.
ko: 연결 전 스크립트가 취소되었습니다
tr: Bağlantı öncesi betik iptal edildi
vi: Script trước khi kết nối đã bị hủy
zh_hans: 连接前脚本已取消
zh_hant: 連線前指令稿已取消

source: Elapsed
fr: Écarté

source: Applied
fr: Appliqué
ko: 적용됨
tr: Uygulandı
vi: Đã áp dụng
zh_hans: 已应用
zh_hant: 已套用

source: Keep this plan when history is cleaned up
fr: Gardez ce plan quand l'histoire sera nettoyée.
ko: 기록을 정리할 때 이 플랜 유지
tr: Geçmiş temizlenirken bu planı sakla
vi: Giữ kế hoạch này khi dọn dẹp lịch sử
zh_hans: 清理历史记录时保留此计划
zh_hant: 清理歷史記錄時保留此計劃

source: Cloudflare hostname is required
fr: Le nom d'hôte Cloudflare est requis.
ko: Cloudflare 호스트 이름이 필요합니다
tr: Cloudflare sunucu adı gerekli
vi: Cần hostname Cloudflare
zh_hans: 需要Cloudflare主机名
zh_hant: 需要 Cloudflare 主機名稱

source: Objects
fr: Objets

source: Include column headers
fr: Inclure les en-têtes de colonne
ko: 열 머리글 포함
tr: Sütun başlıklarını dahil et
vi: Bao gồm tiêu đề cột
zh_hans: 包含列标题
zh_hant: 包含欄位標題

source: Import from %@
fr: Importer de %@
ko: %@에서 가져오기
tr: %@ uygulamasından içe aktar
vi: Nhập từ %@
zh_hans: 从 %@ 导入
zh_hant: 從 %@ 匯入

source: %@ reads and writes through one connection, so it cannot copy rows between two of its schemas. Use a second connection for the target.
fr: %@ lit et écrit à travers une seule connexion, il ne peut donc pas copier des lignes entre deux de ses schémas. Utilisez une deuxième connexion pour la cible.

source: Response failed
fr: Réponse échouée
ko: 응답 실패
tr: Yanıt başarısız oldu
vi: Phản hồi thất bại
zh_hans: 响应失败
zh_hant: 回應失敗

source: Signed in as %@.
fr: Connecté en tant que %@.
ko: %@ 계정으로 로그인했습니다.
tr: %@ olarak oturum açıldı.
vi: Đã đăng nhập với tên %@.
zh_hans: 已以 %@ 身份登录。
zh_hant: 已以 %@ 身分登入。

source: Truncate all tables linked by foreign keys
fr: Truncate toutes les tables liées par des clés étrangères.
ko: 외래 키로 연결된 모든 테이블 비우기
tr: Yabancı anahtarlarla bağlı tüm tabloları boşalt
vi: Xóa dữ liệu tất cả bảng liên kết bằng khóa ngoại
zh_hans: 清空所有通过外键关联的表
zh_hant: 清空所有透過外鍵關聯的資料表

source: Bring an open tab to the front, using a tab id from list_recent_tabs.
fr: Apportez une onglet ouverte en avant, en utilisant un identifiant d'onglet de la liste_recent_tabs.
ko: list_recent_tabs에서 얻은 탭 id로 열려 있는 탭을 앞으로 가져옵니다.
tr: list_recent_tabs'ten alınan bir sekme kimliğiyle açık bir sekmeyi öne getirir.
vi: Đưa một tab đang mở lên trước, dùng tab id lấy từ list_recent_tabs.
zh_hans: 使用 list_recent_tabs 返回的标签页 id 把一个已打开的标签页带到最前。
zh_hant: 使用 list_recent_tabs 回傳的標籤頁 id 把一個已開啟的標籤頁帶到最前。

source: This file requires a newer version of TablePro (format version %d)
fr: Ce fichier nécessite une version plus récente de TablePro (version de format %d)
ko: 이 파일을 사용하려면 더 최신 버전의 TablePro가 필요합니다(파일 형식 버전 %d)
tr: Bu dosya daha yeni bir TablePro sürümü gerektiriyor (format sürümü %d)
vi: Tệp này yêu cầu phiên bản TablePro mới hơn (phiên bản định dạng %d)
zh_hans: 此文件需要更新版本的TablePro（格式版本%d）
zh_hant: 此檔案需要較新版本的 TablePro（格式版本 %d）

source: Delete is off by default, so a first run cannot remove a row from the target.
fr: Supprimer est désactivé par défaut, donc une première exécution ne peut pas supprimer une ligne de la cible.
ko: 삭제는 기본적으로 꺼져 있으므로, 첫 실행에서는 대상의 행을 제거할 수 없습니다.
tr: Silme varsayılan olarak kapalıdır, bu yüzden ilk çalıştırma hedeften satır kaldıramaz.
vi: Xóa mặc định tắt, nên lần chạy đầu tiên không thể xóa dòng khỏi đích.
zh_hans: 删除默认关闭，因此首次运行不会从目标中删除任何行。
zh_hant: 刪除預設關閉，因此首次執行不會從目標中刪除任何列。

source: Themes
fr: Thèmes
ko: 테마
vi: Giao diện
zh_hans: 主题
zh_hant: 佈景主題

source: Wide-Column
fr: Colonne large
ko: 와이드 컬럼
tr: Geniş Sütunlu
zh_hans: 宽列
zh_hant: 寬欄

source: Remove from Recent
fr: Supprimer des favoris
ko: 최근 항목에서 제거
tr: Son Kullanılanlardan Kaldır
vi: Xóa khỏi mục Gần đây
zh_hans: 从“最近”中移除
zh_hant: 從「最近」中移除

source: Rank By
fr: Classer par
ko: 순위 기준
tr: Sıralama Ölçütü
vi: Xếp hạng theo
zh_hans: 排序依据
zh_hant: 排序依據

source: Disable SSH Tunnel
fr: Désactiver le tunnel SSH
ko: SSH 터널 비활성화
tr: SSH Tünelini Devre Dışı Bırak
vi: Tắt SSH Tunnel
zh_hans: 禁用 SSH 隧道
zh_hant: 停用 SSH 隧道

source: Maximum rows to export. Defaults to the server's configured default row limit and is capped at its maximum row limit.
fr: Nombre maximum de lignes à exporter. Par défaut, il s'agit de la limite de lignes par défaut configurée par le serveur et est limitée à sa limite de lignes maximale.
ko: 내보낼 최대 행 수입니다. 기본값은 서버에 설정된 기본 행 제한이며 최대 행 제한을 초과할 수 없습니다.
tr: Dışa aktarılacak en fazla satır sayısı. Varsayılan olarak sunucunun ayarlı varsayılan satır limitidir ve maksimum satır limitiyle sınırlanır.
vi: Số dòng tối đa được xuất. Mặc định là giới hạn dòng mặc định của máy chủ và bị chặn ở giới hạn dòng tối đa.
zh_hans: 导出的最大行数。默认使用服务器配置的默认行数限制，并受其最大行数限制约束。
zh_hant: 匯出的最大列數。預設使用伺服器設定的預設列數上限，並受其最大列數上限限制。

source: Not synced to iCloud
fr: Pas synchronisé avec iCloud

source: That tab is not open.
fr: Cette onglet n'est pas ouverte.

source: Apply filters
fr: Appliquer des filtres
ko: 필터 적용
tr: Filtreleri uygula
vi: Áp dụng bộ lọc
zh_hans: 应用筛选
zh_hant: 套用篩選

source: No providers configured
fr: Aucun fournisseur configuré
ko: 구성된 제공업체 없음
tr: Yapılandırılmış sağlayıcı yok
vi: Chưa cấu hình nhà cung cấp
zh_hans: 未配置提供商
zh_hant: 未設定供應商

source: Missing argument: %@
fr: Argument manquant : %@
ko: 누락된 인수: %@
tr: Eksik bağımsız değişken: %@
vi: Thiếu đối số: %@
zh_hans: 缺少参数：%@
zh_hant: 缺少引數：%@

source: TablePro connects to the first node over a tunnel, as a single server. Keys on other nodes cannot be reached.
fr: TablePro se connecte au premier nœud via un tunnel, en tant que seul serveur. Les clés sur les autres nœuds ne peuvent pas être atteintes.

source: List indexes for one table, or for every table in the schema when 'table' is omitted. Use it to see what a query can actually use before proposing one.
fr: Liste des indices pour une table, ou pour toutes les tables du schéma lorsque 'table' est omis. Utilisez-le pour voir ce que une requête peut réellement utiliser avant de la proposer.
ko: 한 테이블의 인덱스를 나열하며, 'table'을 생략하면 스키마의 모든 테이블을 나열합니다. 쿼리를 제안하기 전에 실제로 사용할 수 있는 인덱스를 확인하십시오.
tr: Bir tablonun, 'table' verilmediğinde ise şemadaki her tablonun indekslerini listeler. Bir sorgu önermeden önce sorgunun gerçekte neyi kullanabileceğini görmek için kullanın.
vi: Liệt kê chỉ mục của một bảng, hoặc của mọi bảng trong schema khi bỏ trống 'table'. Dùng nó để biết một truy vấn thực sự dùng được gì trước khi đề xuất truy vấn.
zh_hans: 列出一张表的索引，或者在省略 'table' 时列出该 Schema 中每张表的索引。在提出查询之前用它了解查询真正能用到什么。
zh_hant: 列出一張資料表的索引，或者在省略 'table' 時列出該綱要中每張資料表的索引。在提出查詢之前用它了解查詢真正能用到什麼。

source: %@ completed
fr: %@ terminé
ko: %@ 완료
tr: %@ tamamlandı
vi: %@ hoàn tất
zh_hans: %@ 已完成
zh_hant: %@ 已完成

source: License removed from this Mac, but the server could not be reached. The activation slot may not be freed until it expires.
fr: La licence a été supprimée de ce Mac, mais le serveur n'a pas pu être atteint. L'espace d'activation ne pourra pas être libéré avant son expiration.
ko: 이 Mac에서 라이선스가 제거되었지만 서버에 연결할 수 없습니다. 만료될 때까지 활성화 슬롯이 해제되지 않을 수 있습니다.
tr: Lisans bu Mac'ten kaldırıldı, ancak sunucuya ulaşılamadı. Etkinleştirme yuvası süresi dolana kadar serbest bırakılmayabilir.
vi: Giấy phép đã xoá khỏi máy Mac này, nhưng không thể liên hệ máy chủ. Vị trí kích hoạt có thể không được giải phóng cho đến khi hết hạn.
zh_hans: 许可证已从此 Mac 移除，但无法连接服务器。激活位可能需要到期后才能释放。
zh_hant: 授權已從此 Mac 移除,但無法連線到伺服器。啟用名額可能要到期後才會釋出。

source: Hostname
fr: Nom d'hôte
ko: 호스트 이름
tr: Sunucu adı
vi: Tên máy chủ
zh_hans: 主机名
zh_hant: 主機名稱

source: Validation Failed
fr: Validation échouée
ko: 유효성 검사 실패
tr: Doğrulama Başarısız
vi: Xác thực thất bại
zh_hans: 验证失败
zh_hant: 驗證失敗

source: Convert line break to space
fr: Convertir la ligne brisée en espace
ko: 줄바꿈을 공백으로 변환
tr: Satır sonunu boşluğa çevir
vi: Chuyển xuống dòng thành dấu cách
zh_hans: 将换行转换为空格
zh_hant: 將換行轉換為空格

source: Every row in each destination table is deleted first. This cannot be undone.
fr: Chaque ligne de chaque table de destination est supprimée en premier. Cela ne peut pas être annulé.

source: Status: active
fr: Statut : actif
ko: 상태: 활성
tr: Durum: aktif
vi: Trạng thái: đang hoạt động
zh_hans: 状态：活动
zh_hant: 狀態：使用中

source: Denied
fr: Négatif
ko: 거부됨
tr: Reddedildi
vi: Đã từ chối
zh_hans: 已拒绝
zh_hant: 已拒絕

source: The server is rate limiting TablePro. Try again shortly.
fr: Le serveur limite la vitesse de TablePro. Réessayez sous peu.

source: Restore the previous values of a save
fr: Restaurer les valeurs précédentes d'un enregistrement.
ko: 저장 이전의 값 복원
tr: Bir kaydetmenin önceki değerlerini geri yükle
vi: Khôi phục giá trị trước một lần lưu
zh_hans: 恢复某次保存之前的值
zh_hant: 還原某次儲存之前的值

source: No key or value matches this filter
fr: Aucune clé ou valeur ne correspond à ce filtre.

source: Opening the tunnel
fr: Ouverture du tunnel
ko: 터널 여는 중
tr: Tünel açılıyor
vi: Đang mở tunnel
zh_hans: 正在打开隧道
zh_hant: 正在開啟隧道

source: Filter by only this row
fr: Filtrer uniquement par cette ligne
ko: 이 행만 기준으로 필터링
tr: Yalnızca bu satıra göre filtrele
vi: Chỉ lọc theo hàng này
zh_hans: 仅按此行筛选
zh_hant: 僅依此列篩選

source: Schema for %@
fr: Schéma pour %@
ko: %@의 스키마
tr: %@ şeması
vi: Schema của %@
zh_hans: %@ 的 Schema
zh_hant: %@ 的綱要

source: This will permanently delete all query history entries, and the saved changes kept for restoring. This action cannot be undone.
fr: Cela supprimera définitivement toutes les entrées de l'historique des requêtes et les modifications enregistrées pour la restauration seront conservées. Cette action ne peut pas être annulée.
ko: 모든 쿼리 기록 항목과 복원을 위해 보관 중인 저장된 변경 사항이 영구히 삭제됩니다. 이 작업은 되돌릴 수 없습니다.
tr: Bu, tüm sorgu geçmişi girdilerini ve geri yükleme için saklanan kaydedilmiş değişiklikleri kalıcı olarak siler. Bu işlem geri alınamaz.
vi: Thao tác này sẽ xoá vĩnh viễn toàn bộ mục lịch sử truy vấn và các thay đổi đã lưu để khôi phục. Không thể hoàn tác.
zh_hans: 这会永久删除所有查询历史条目，以及为恢复而保留的已保存更改。此操作无法撤销。
zh_hant: 這會永久刪除所有查詢記錄項目，以及為還原而保留的已儲存變更。此操作無法還原。

source: Name the new database.
fr: Nommez la nouvelle base de données.

source: encoding: %@
fr: Encodage : %@
ko: 인코딩: %@
tr: kodlama: %@
vi: bảng mã: %@
zh_hans: 编码：%@
zh_hant: 編碼：%@

source: Could not encode image
fr: Impossible d'encoder l'image
ko: 이미지를 인코딩할 수 없습니다
tr: Görüntü kodlanamadı
vi: Không thể mã hóa hình ảnh
zh_hans: 无法编码图像
zh_hant: 無法編碼影像
